title: Process Enumeration - tasklist
id: 20260702161449Dis
status: experimental
description: Detects tasklist execution.
references:
  - https://www.fbi.gov/file-repository/cyber-alerts/stopransomware-medusa-ransomware-031225.pdf/view
author: Detection Engineering Team
date: 2026-07-02
logsource:
  category: process
  product: windows
detection:
    selection:
      Image|endswith: "\tasklist.exe"
    condition: selection
falsepositives:
  - Legitimate use.
level: low
tags:
  - attack.T1057
  - ransomware.krybit
  - ransomware.0apt
