title: Disk Wipe (cipher /w)
id: 20260702161449Imp
status: experimental
description: Detects cipher /w to wipe free space.
references:
  - https://www.fbi.gov/file-repository/cyber-alerts/stopransomware-medusa-ransomware-031225.pdf/view
author: Detection Engineering Team
date: 2026-07-02
logsource:
  category: process
  product: windows
detection:
    selection:
      Image|endswith: "\cipher.exe"
      CommandLine|contains: "/w"
    condition: selection
falsepositives:
  - Security policy.
level: high
tags:
  - attack.T1485
  - ransomware.krybit
  - ransomware.0apt
