title: AMSI Bypass Indicators
id: 20260702161449Def
status: experimental
description: Detects common AMSI bypass patterns in PowerShell.
references:
  - https://www.fbi.gov/file-repository/cyber-alerts/stopransomware-medusa-ransomware-031225.pdf/view
author: Detection Engineering Team
date: 2026-07-02
logsource:
  category: process
  product: windows
detection:
    selection:
      Image|endswith: "\powershell.exe"
      CommandLine|contains|any: ["amsi", "bypass", "reflection"]
    condition: selection
falsepositives:
  - May trigger on administrative scripts.
level: high
tags:
  - attack.T1562
  - ransomware.krybit
  - ransomware.0apt
