title: Rclone Execution
id: 20260702161449Exf
status: experimental
description: Detects rclone.exe with sync/copy arguments.
references:
  - https://www.fbi.gov/file-repository/cyber-alerts/stopransomware-medusa-ransomware-031225.pdf/view
author: Detection Engineering Team
date: 2026-07-02
logsource:
  category: process
  product: windows
detection:
    selection:
      Image|endswith: "\rclone.exe"
      CommandLine|contains|any: ["sync", "copy", "move"]
    condition: selection
falsepositives:
  - Legitimate data sync.
level: high
tags:
  - attack.T1048
  - ransomware.krybit
  - ransomware.0apt
